app/controllers/my_comments_controller.rb

  def create

    @my_comment = @my_thread.my_comments.new(my_comment_params)

    respond_to do |format|
      if @my_comment.save
---
INSERT INTO `my_comments` (`content`, `created_at`, `my_thread_id`, `updated_at`) VALUES ('aaaa', '2016-05-11 10:39:58', 5, '2016-05-11 10:39:58')

  def update
    respond_to do |format|
      if @my_comment.update(my_comment_params)
---
UPDATE `my_comments` SET `content` = 'commmmmment1', `updated_at` = '2016-05-16 07:28:20' WHERE `my_comments`.`id` = 1

  def destroy
    @my_comment.destroy
---
DELETE FROM `my_comments` WHERE `my_comments`.`id` = 3

  def set_my_comment
      @my_comment = @my_thread.my_comments.find(params[:id])
---
SELECT  `my_comments`.* FROM `my_comments`  WHERE `my_comments`.`my_thread_id` = 1 AND `my_comments`.`id` = 3 LIMIT 1

  def set_my_thread
      @my_thread = MyThread.find params[:my_thread_id]#モデルを経由してデータベースに入る。:はシンボル。
---
SELECT  `my_threads`.* FROM `my_threads`  WHERE `my_threads`.`id` = 5 LIMIT 1